{
  "experiences": [
    {
      "company": "Motius",
      "nature": "Full time",
      "role": "Frontend developer",
      "categories": ["FE"],
      "startDate": "4/2020",
      "endDate": "10/2020",
      "technologies": ["React.js"],
      "synopsis": "Develop various web applications with React.js, following the Scrum process.",
      "tasks": [
        "Develop various web applications with React with sophisticated data structure and business logic.",
        "Making heavy and practical use of Redux, Git, Jira etc.",
        "Following Agile process: Sprint planning, Code review, standups and QAs"
      ]
    },
    {
      "company": "Siemens",
      "nature": "Working Student",
      "role": "Working Student",
      "categories": ["ML", "BE"],
      "startDate": "4/2019",
      "endDate": "4/2020",
      "technologies": ["Flask", "Tensorflow", "OpenCV", "ARKit"],
      "tasks": [
        "Develop algorithms for constructing 3D model from data provided by ARKit",
        "Develop servers for storing and communicating between iOS apps and Python clients for visualization"
      ],
      "synopsis": "Assists in implementing softwares in research projects related to 3D reconstructions and Augmented Reality"
    },
    {
      "company": "Technical University of Munich (Junge Akademie)",
      "nature": "Part time",
      "role": "Full Stack Developer",
      "categories": ["FE", "BE"],
      "startDate": "1/2019",
      "endDate": "4/2019",
      "technologies": ["Express.js", "Mongoose", "React.js"],
      "tasks": [
        "Build a prototype of a online platform which facilitates communication between politicians and students with MERN stack",
        "All common authenication and account management actions implemented: Login / Register account, email confirmation and reset password"
      ],
      "synopsis": "My task is to develop a web platform that enables politicians and students to communicate and participate in different project."
    },
    {
      "company": "Technical University of Munich",
      "nature": "Part time",
      "role": "Research Assistant",
      "startDate": "10/2018",
      "categories": ["IOT", "BE"],
      "endDate": "1/2019",
      "technologies": ["Flask", "ESP8266", "Raspberry Pi", " Micropython"],
      "tasks": [
        "Program several embedded devices to broadcast the readings of their sensors to a server",
        "Program a server that conforms to the Web of Things (WoT) protocol, as well as communicating with several devices through MQTT."
      ],
      "synopsis": "My task is to set up a Web of Things (WoT) network in which devices submit their \"Thing Description\" (TD) that describes their functionalities and API endpoints to access them."
    },
    {
      "company": "Technical University of Munich (iPraktikum)",
      "nature": "Practical Course",
      "role": "Mobile application developer",
      "startDate": "10/2018",
      "categories": ["FE", "BE"],
      "endDate": "4/2019",
      "technologies": ["Swift", "ARKit", "WebRTC", "flask", "express.js"],
      "tasks": [
        "Develop a real-time video call application on iOS with AR-Powered features, including 3D Drawing, eye tracking, goal-seeking with AR markers.",
        "The app aims to facilitate communication and enchance communication between engineers on field and remote experts.",
        "Scrum process being followed: Regular sprints, standups, code review and client meetings"
      ],
      "synopsis": "A practical course in which our team follows the scrum development pattern throughour the semester to create a video call iOS app with several Augmented Reality features."
    },
    {
      "company": "Masterson",
      "nature": "Part time",
      "role": "Web Application Developer",
      "startDate": "4/2018",
      "endDate": "5/2018",
      "categories": ["FE"],

      "technologies": ["Vue"],
      "tasks": [
        "Develop a dashboard for displaying locations of bike stations as well as route planning",
        "Requires project completion in a severe time constraint"
      ],
      "synopsis": "My task is to develop 2 dashboards that displays JSON data from a given API within 3 weeks. Vue is chosen to complete this task."
    },
    {
      "company": "Smokeless",
      "nature": "Working Student",
      "role": "App Developer",
      "startDate": "1/2018",
      "endDate": "10/2018",
      "categories": ["FE"],
      "technologies": ["Vue", "Cordova"],
      "tasks": ["Develop hybrid mobile application with Vue and Cordova"],
      "synopsis": "I am responsible for developing a hybrid application for the clinical trial participants of the test conducted by this company"
    }
  ]
}
